; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=87, out_folder=htg/blocksworld/training, instance_id=67, seed=2091, goal_proportion=0.1

(define (problem blocksworld-67)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 - object)
 (:init 
    (arm-empty)
    (clear b36)
    (on-table b36)
    (clear b73)
    (on-table b73)
    (clear b3)
    (on b3 b10)
    (on b10 b51)
    (on b51 b60)
    (on b60 b77)
    (on b77 b50)
    (on b50 b59)
    (on b59 b32)
    (on b32 b28)
    (on b28 b52)
    (on b52 b78)
    (on-table b78)
    (clear b81)
    (on b81 b71)
    (on b71 b11)
    (on b11 b62)
    (on-table b62)
    (clear b83)
    (on b83 b57)
    (on b57 b74)
    (on b74 b67)
    (on b67 b72)
    (on-table b72)
    (clear b54)
    (on b54 b40)
    (on b40 b5)
    (on b5 b68)
    (on b68 b18)
    (on b18 b84)
    (on b84 b80)
    (on-table b80)
    (clear b58)
    (on-table b58)
    (clear b76)
    (on b76 b29)
    (on-table b29)
    (clear b34)
    (on-table b34)
    (clear b35)
    (on b35 b42)
    (on b42 b22)
    (on b22 b25)
    (on b25 b16)
    (on b16 b55)
    (on-table b55)
    (clear b45)
    (on b45 b46)
    (on b46 b53)
    (on-table b53)
    (clear b63)
    (on b63 b30)
    (on-table b30)
    (clear b65)
    (on b65 b82)
    (on b82 b2)
    (on b2 b14)
    (on-table b14)
    (clear b8)
    (on b8 b7)
    (on b7 b43)
    (on b43 b41)
    (on b41 b27)
    (on b27 b79)
    (on-table b79)
    (clear b87)
    (on-table b87)
    (clear b1)
    (on b1 b66)
    (on b66 b24)
    (on b24 b9)
    (on b9 b26)
    (on b26 b31)
    (on-table b31)
    (clear b75)
    (on b75 b56)
    (on-table b56)
    (clear b13)
    (on-table b13)
    (clear b6)
    (on b6 b69)
    (on-table b69)
    (clear b44)
    (on b44 b15)
    (on b15 b47)
    (on b47 b64)
    (on b64 b37)
    (on b37 b4)
    (on-table b4)
    (clear b17)
    (on b17 b86)
    (on b86 b23)
    (on b23 b39)
    (on b39 b70)
    (on b70 b33)
    (on b33 b20)
    (on b20 b21)
    (on b21 b61)
    (on-table b61)
    (clear b48)
    (on b48 b85)
    (on b85 b19)
    (on-table b19)
    (clear b12)
    (on-table b12)
    (clear b49)
    (on-table b49)
    (clear b38)
    (on-table b38))
 (:goal  (and 
    (clear b7)
    (on b7 b5)
    (on b5 b4)
    (on b4 b2)
    (on b2 b6)
    (on b6 b1)
    (on-table b1)
    (clear b8)
    (on b8 b3)
    (on-table b3))))

; plan
1. (unstack b8 b7)
   deleted: (on b8 b7) (clear b8) (arm-empty)
   added: (holding b8) (clear b7)
   goals met: 1 of 10
2. (stack b8 b3)
   deleted: (clear b3) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b3)
   goals met: 3 of 10
3. (unstack b6 b69)
   deleted: (on b6 b69) (clear b6) (arm-empty)
   added: (holding b6) (clear b69)
   goals met: 3 of 10
4. (stack b6 b1)
   deleted: (clear b1) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b1)
   goals met: 4 of 10
5. (unstack b65 b82)
   deleted: (on b65 b82) (clear b65) (arm-empty)
   added: (holding b65) (clear b82)
   goals met: 4 of 10
6. (putdown b65)
   deleted: (holding b65)
   added: (clear b65) (arm-empty) (on-table b65)
   goals met: 4 of 10
7. (unstack b82 b2)
   deleted: (on b82 b2) (clear b82) (arm-empty)
   added: (holding b82) (clear b2)
   goals met: 4 of 10
8. (putdown b82)
   deleted: (holding b82)
   added: (clear b82) (arm-empty) (on-table b82)
   goals met: 4 of 10
9. (unstack b2 b14)
   deleted: (on b2 b14) (clear b2) (arm-empty)
   added: (holding b2) (clear b14)
   goals met: 4 of 10
10. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 5 of 10
11. (unstack b44 b15)
   deleted: (on b44 b15) (clear b44) (arm-empty)
   added: (holding b44) (clear b15)
   goals met: 5 of 10
12. (putdown b44)
   deleted: (holding b44)
   added: (clear b44) (arm-empty) (on-table b44)
   goals met: 5 of 10
13. (unstack b15 b47)
   deleted: (on b15 b47) (clear b15) (arm-empty)
   added: (holding b15) (clear b47)
   goals met: 5 of 10
14. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 5 of 10
15. (unstack b47 b64)
   deleted: (on b47 b64) (clear b47) (arm-empty)
   added: (holding b47) (clear b64)
   goals met: 5 of 10
16. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 5 of 10
17. (unstack b64 b37)
   deleted: (on b64 b37) (clear b64) (arm-empty)
   added: (holding b64) (clear b37)
   goals met: 5 of 10
18. (putdown b64)
   deleted: (holding b64)
   added: (clear b64) (arm-empty) (on-table b64)
   goals met: 5 of 10
19. (unstack b37 b4)
   deleted: (on b37 b4) (clear b37) (arm-empty)
   added: (holding b37) (clear b4)
   goals met: 5 of 10
20. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 5 of 10
21. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 5 of 10
22. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 6 of 10
23. (unstack b54 b40)
   deleted: (on b54 b40) (clear b54) (arm-empty)
   added: (holding b54) (clear b40)
   goals met: 6 of 10
24. (putdown b54)
   deleted: (holding b54)
   added: (clear b54) (arm-empty) (on-table b54)
   goals met: 6 of 10
25. (unstack b40 b5)
   deleted: (on b40 b5) (clear b40) (arm-empty)
   added: (holding b40) (clear b5)
   goals met: 6 of 10
26. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 6 of 10
27. (unstack b7 b43)
   deleted: (on b7 b43) (clear b7) (arm-empty)
   added: (holding b7) (clear b43)
   goals met: 5 of 10
28. (stack b7 b5)
   deleted: (clear b5) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b5)
   goals met: 7 of 10
29. (unstack b8 b3)
   deleted: (on b8 b3) (clear b8) (arm-empty)
   added: (holding b8) (clear b3)
   goals met: 5 of 10
30. (stack b8 b4)
   deleted: (clear b4) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b4)
   goals met: 6 of 10
31. (unstack b3 b10)
   deleted: (on b3 b10) (clear b3) (arm-empty)
   added: (holding b3) (clear b10)
   goals met: 6 of 10
32. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 7 of 10
33. (unstack b8 b4)
   deleted: (on b8 b4) (clear b8) (arm-empty)
   added: (holding b8) (clear b4)
   goals met: 6 of 10
34. (stack b8 b3)
   deleted: (clear b3) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b3)
   goals met: 8 of 10
35. (unstack b4 b2)
   deleted: (on b4 b2) (clear b4) (arm-empty)
   added: (holding b4) (clear b2)
   goals met: 7 of 10
36. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 7 of 10
37. (unstack b2 b6)
   deleted: (on b2 b6) (clear b2) (arm-empty)
   added: (holding b2) (clear b6)
   goals met: 6 of 10
38. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 6 of 10
39. (unstack b6 b1)
   deleted: (on b6 b1) (clear b6) (arm-empty)
   added: (holding b6) (clear b1)
   goals met: 5 of 10
40. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 5 of 10
41. (unstack b1 b66)
   deleted: (on b1 b66) (clear b1) (arm-empty)
   added: (holding b1) (clear b66)
   goals met: 5 of 10
42. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 6 of 10
43. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 6 of 10
44. (stack b6 b1)
   deleted: (clear b1) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b1)
   goals met: 7 of 10
45. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 7 of 10
46. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 8 of 10
47. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 8 of 10
48. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 9 of 10
49. (unstack b7 b5)
   deleted: (on b7 b5) (clear b7) (arm-empty)
   added: (holding b7) (clear b5)
   goals met: 7 of 10
50. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 8 of 10
51. (unstack b5 b68)
   deleted: (on b5 b68) (clear b5) (arm-empty)
   added: (holding b5) (clear b68)
   goals met: 8 of 10
52. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 9 of 10
53. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 8 of 10
54. (stack b7 b5)
   deleted: (clear b5) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b5)
   goals met: 10 of 10
